<!-- dflook/terraform-github-actions {"workspace":"prod","backend_type":"s3","backend":"05aab549029d38ee3e51ba40c9367232bee10d41abe4d7f6f37d4cfc96cbd6df","plan_job_ref":"Job Infrastructure #229 at https://github.com/coverage-robot/core/actions/runs/6474862042","plan_hash":"601851f223512e9abd74ad0ad2b5c2ea5bde2863e1c0c465dd8d9d7ca318c1a7","plan_text_format":"text","version":"1.36.2"} -->
Terraform plan in __./infrastructure__ in the __prod__ workspace
With var files: `./infrastructure/prod.tfvars`<details open><summary>With variables</summary>

```hcl
planetscale_service_token    = (sensitive value)
planetscale_service_token_id = (sensitive value)
```
</details>
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.warehouse.google_bigquery_table.upload will be created
  + resource "google_bigquery_table" "upload" {
      + creation_time       = (known after apply)
      + dataset_id          = "****"
      + deletion_protection = false
      + effective_labels    = (known after apply)
      + etag                = (known after apply)
      + expiration_time     = (known after apply)
      + id                  = (known after apply)
      + last_modified_time  = (known after apply)
      + location            = (known after apply)
      + num_bytes           = (known after apply)
      + num_long_term_bytes = (known after apply)
      + num_rows            = (known after apply)
      + project             = "coverage-384615"
      + schema              = jsonencode(
            [
              + {
                  + description = "The unique upload id for the uploaded file."
                  + mode        = "REQUIRED"
                  + name        = "uploadId"
                  + type        = "STRING"
                },
              + {
                  + description = "The commit hash which the upload occured on."
                  + mode        = "REQUIRED"
                  + name        = "commit"
                  + type        = "STRING"
                },
              + {
                  + description = "The parent commit hash(es) of the commit upload occured on."
                  + mode        = "REPEATED"
                  + name        = "parent"
                  + type        = "STRING"
                },
              + {
                  + description = "The ref (e.g. branch) in the VCS provider."
                  + mode        = "REQUIRED"
                  + name        = "ref"
                  + type        = "STRING"
                },
              + {
                  + description = "The user provided tag of the upload."
                  + mode        = "REQUIRED"
                  + name        = "tag"
                  + type        = "STRING"
                },
              + {
                  + description = "The repository owner for the VCS provider."
                  + mode        = "REQUIRED"
                  + name        = "owner"
                  + type        = "STRING"
                },
              + {
                  + description = "The repository name for the VCS provider."
                  + mode        = "REQUIRED"
                  + name        = "repository"
                  + type        = "STRING"
                },
              + {
                  + description = "The VCS provider."
                  + mode        = "REQUIRED"
                  + name        = "provider"
                  + type        = "STRING"
                },
              + {
                  + description = "The time the upload occurred."
                  + mode        = "NULLABLE"
                  + name        = "ingestTime"
                  + type        = "DATETIME"
                },
            ]
        )
      + self_link           = (known after apply)
      + table_id            = "******"
      + terraform_labels    = (known after apply)
      + type                = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ line_coverage_table       = {
      ~ etag                        = "sevXl9ZL3yxphc8INSAqnQ==" -> "Z8NeWnkX1VvrefoAOSS7sg=="
        id                          = "projects/coverage-384615/datasets/prod/tables/line_coverage"
      ~ last_modified_time          = 1696968538681 -> 1696969520120
        # (27 unchanged attributes hidden)
    }
```
</details>

:memo: Plan generated in [Infrastructure #229](https://github.com/coverage-robot/core/actions/runs/6474862042)